export const weatherCategory = {
    T1H: '기온',
    RN1: '1시간 강수량',
    SKY: '하늘상태',
    UUU: '동서바람성분',
    VVV: '남북바람성분',
    REH: '습도',
    PTY: '강수형태',
    LGT: '낙뢰',
    VEC: '풍향',
    WSD: '풍속',
};

export const categorySymbols = {
    기온: '°C',
    '1시간 강수량': 'mm',
    하늘상태: '',
    동서바람성분: 'm/s',
    남북바람성분: 'm/s',
    습도: '%',
    강수형태: '',
    낙뢰: 'kA',
    풍향: 'deg',
    풍속: 'm/s',
};
// export const weatherCategoryEmojis = {
//     기온: '🌡️', // 기온
//     '1시간 강수량': '🌧️', // 1시간 강수량
//     하늘상태: '☀️', // 하늘상태
//     동서바람성분: '↔️', // 동서바람성분
//     남북바람성분: '↕️', // 남북바람성분
//     습도: '💧', // 습도
//     강수형태: '🌦️', // 강수형태
//     낙뢰: '⚡', // 낙뢰
//     풍향: '🧭', // 풍향
//     풍속: '🌬️', // 풍속
// };
